In [1]:
import pandas as pd
import numpy as np

In [54]:
dt={'name':['smith','jhon','tom','micky','belly','fizz','ricky'],'age':[25,26,25,23,30,29,23],
    'rating':[4.23,3.24,3.98,2.56,3.20,4.60,3.80]}

In [55]:
df=pd.DataFrame(dt)

In [4]:
df

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [ ]:
#basic prop.

In [5]:
df.T

            0     1     2      3      4     5      6
name    smith  jhon   tom  micky  belly  fizz  ricky
age        25    26    25     23     30    29     23
rating   4.23  3.24  3.98   2.56    3.2   4.6    3.8

In [6]:
df

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [7]:
df.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['name', 'age', 'rating'], dtype='object')]

In [8]:
df.dtypes  #display data type of each column

name       object
age         int64
rating    float64
dtype: object

In [9]:
df.ndim #number of dimension

2

In [10]:
df.shape #(no. rows,no. cols)

(7, 3)

In [11]:
df.size #total number of items

21

In [ ]:
len(df) #number of rows in a dataframe

In [13]:
df

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [14]:
df.values   #array of values

array([['smith', 25, 4.23],
       ['jhon', 26, 3.24],
       ['tom', 25, 3.98],
       ['micky', 23, 2.56],
       ['belly', 30, 3.2],
       ['fizz', 29, 4.6],
       ['ricky', 23, 3.8]], dtype=object)

In [16]:
df

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [15]:
df.head() # display first 5 records

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20

In [17]:
df.head(3) #display specific records

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98

In [18]:
df.tail() #display last 5 records

    name  age  rating
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [ ]:
# Q. display last 3 records
#type your ans here

In [22]:
df["rating"].sum()

25.610000000000003

In [20]:
df.sum()

name      smithjhontommickybellyfizzricky
age                                   181
rating                              25.61
dtype: object

In [23]:
df["rating"].sum()

25.610000000000003

In [27]:
df[["age","rating"]].sum()

age       181.00
rating     25.61
dtype: float64

In [28]:
df["age"].mean()

25.857142857142858

In [ ]:
#cal avf of rating column

In [31]:
df[["age","rating"]].sum(axis=1)  #axis =0 column wise sum (default)
                #axis=1 row wise sum

0    29.23
1    29.24
2    28.98
3    25.56
4    33.20
5    33.60
6    26.80
dtype: float64

In [ ]:
df.min()

In [ ]:
df.max()

In [ ]:
#Q find min value of age column

#type your ans here

In [ ]:
#Q find max value of rating column

#type your ans here

In [ ]:
#Q find mean of age column
#type your ans here

In [32]:
df.info() #print information of data frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   rating  7 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 300.0+ bytes

In [ ]:
df

In [ ]:
# df["age"].min()

In [ ]:
# df["rating"].mean()

In [ ]:
# df["age"].median()

In [33]:
df

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [36]:

df[df["age"]>25]

    name  age  rating
1   jhon   26    3.24
4  belly   30    3.20
5   fizz   29    4.60

In [40]:
df[df["age"]>25][["name","age"]]

    name  age
1   jhon   26
4  belly   30
5   fizz   29

In [38]:
df

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [ ]:
#display all info about the student whose age is 25
# display name of students whose rating is above 4
# display avg rating of students whose age is above 25

In [57]:
df

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [56]:
df[df["age"]==25]

    name  age  rating
0  smith   25    4.23
2    tom   25    3.98

In [58]:
df[df["rating"]>4]["name"]

0    smith
5     fizz
Name: name, dtype: object

In [59]:
df[df["age"]>4]["rating"].mean()

3.658571428571429

In [60]:
df

    name  age  rating
0  smith   25    4.23
1   jhon   26    3.24
2    tom   25    3.98
3  micky   23    2.56
4  belly   30    3.20
5   fizz   29    4.60
6  ricky   23    3.80

In [63]:
df[(df["age"]>20) & (df["age"]<=25)]

    name  age  rating
0  smith   25    4.23
2    tom   25    3.98
3  micky   23    2.56
6  ricky   23    3.80

In [67]:
df.describe() #descriptive stats of all numerical columns

             age    rating
count   7.000000  7.000000
mean   25.857143  3.658571
std     2.734262  0.698628
min    23.000000  2.560000
25%    24.000000  3.220000
50%    25.000000  3.800000
75%    27.500000  4.105000
max    30.000000  4.600000

In [68]:
dict={"Product":["Pencils","Pens","Notebooks","WaterBottles","PaperSheets"],
     "Price":[10,20,35,40,60],
     "Qnty":[90,50,60,20,10],
     "Rating":[5,3.5,2.5,4.5,3.5]}

In [69]:
d=pd.DataFrame(dict)
d

        Product  Price  Qnty  Rating
0       Pencils     10    90     5.0
1          Pens     20    50     3.5
2     Notebooks     35    60     2.5
3  WaterBottles     40    20     4.5
4   PaperSheets     60    10     3.5

In [72]:
d[d["Qnty"]>50]["Product"]

0      Pencils
2    Notebooks
Name: Product, dtype: object

In [73]:
#find product whose price is less than 40 but Qnty<50

In [74]:
d[(d["Price"]<40) & (d["Qnty"]>50)]

     Product  Price  Qnty  Rating
0    Pencils     10    90     5.0
2  Notebooks     35    60     2.5

In [77]:
d[(d["Price"]<40) & (d["Qnty"]>50)]["Rating"].mean()

3.75